In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}
# dictionary = {'col_name':[data values]}

In [3]:
df = pd.DataFrame(d)

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

# 1. Dropping NaN (Null) values
      These are missing values

### Type 1:  Dropping rows containing NaN (Null) values

In [5]:
df.dropna()
# for rows: axis=0 by default

     A    B  C
0  1.0  5.0  1

### Type 2:  Dropping columns containing NaN (Null) values

In [6]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

### Type 3:  Dropping rows/columns containing NaN values based on 'thresh' value
### NOTE: Here a row/column must have the specified number of non-NaN values to not get dropped.

In [9]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

### For Rows:

In [13]:
df.dropna(axis=0, thresh=3)
# meaning: drop all rows which have less than 3 non-NaN values

     A    B  C
0  1.0  5.0  1

In [11]:
df.dropna(axis=0, thresh=2)
# meaning: drop all rows which have less than 2 non-NaN values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [14]:
df.dropna(axis=0, thresh=1)
# meaning: drop all rows which have less than 1 non-NaN values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

### For Columns:

In [16]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [19]:
df.dropna(axis=1, thresh=3)
# meaning: drop all columns which have less than 3 non-NaN values

   C
0  1
1  2
2  3

In [20]:
df.dropna(axis=1, thresh=2)
# meaning: drop all columns which have less than 2 non-NaN values

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [23]:
df.dropna(axis=1, thresh=1)
# meaning: drop all columns which have less than 1 non-NaN values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

# 2. Filling NaN (Null) values

### Type 1: Filling in all NaN (missing) values

In [24]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [25]:
df.fillna(value='Fill Value')

            A           B  C
0           1           5  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [26]:
df.fillna(value=69)

      A     B  C
0   1.0   5.0  1
1   2.0  69.0  2
2  69.0  69.0  3

### Type 2: Filling in specific NaN (missing) values

#### Example 1: Filling in missing values in column 'A' with mean of col 'A'

In [27]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [28]:
df['A'].fillna(value=df['A'].mean())
# mean = 1+2/2 = 1.5

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

#### Example 2: Filling in missing values in column 'B' with mean of col 'B'

In [29]:
df['B']

0    5.0
1    NaN
2    NaN
Name: B, dtype: float64

In [30]:
df['B'].fillna(value=df['B'].mean())
# mean = 5/1 = 5.0

0    5.0
1    5.0
2    5.0
Name: B, dtype: float64